{"1": {"reviewer": "ruiwenge2", "author": "Rick Riordan", "title": "Percy Jackson", "details": "Percy Jackson is a Greek demigod who discovered that his dad is a Greek god, and he needs to stay at a camp called Camp Half-Blood (a training camp that's safe for Greek demigods and teaches demigods how to survive) during the summer. He has to fight many monsters to survive. He goes on quests and finds out that the Titans, along with many monsters, are planning to destroy Olympus and the gods. Percy and his friends must find a way to stop them."}, "2": {"reviewer": "ruiwenge2", "author": "J. K. Rowling", "title": "Harry Potter", "details": "Harry Potter is a wizard and goes to the Hogwarts School of Witchcraft and Wizardry. His parents were killed by the evil wizard Voldemort when he was only one year old. But when Voldemort tried to kill Harry, his curse rebounded. Harry survived, and Voldemort disappeared. No one has seen Voldemort in many years, but he's finally coming back..."}, "3": {"reviewer": "ruiwenge2", "author": "Tui T. Sutherland", "title": "Wings of Fire", "details": "So far, there are three arcs in the Wings of Fire series. Each arc consists of five books. They're about dragons. The first arc is about the dragons on the continent of Pyrrhia.The SandWing queen, Queen Oasis, has been killed by a scavenger. The three heirs to the throne, Burn, Blister, and Blaze, are fighting to be queen. Burn is allied with the MudWings and SkyWings, Blister is allied with the SeaWings, and Blaze is allied with the IceWings. Most of the SandWings support Blaze as well. The NightWings have delivered a prophecy about how the war will end, saying that when the war has lasted twenty years, there will be five dragonets (a MudWing, SeaWing, SkyWing, NightWing, and SandWing) born on the brightest night, and they're \"born to end the fight.\" In the second arc, the dragonets of destiny have opened a new school on Jade Mountain. The school, Jade Mountain Academy, welcomes dragons from all tribes to learn with each other. Moonwatcher, a NightWing dragonet with the ability to read minds and tell the future, gave a prophecy that told that Jade Mountain would fall unless the \"lost city of night can be found.\"  Queen Scarlet, the evil dragon who used to be the queen of SkyWings, wants to kill the dragonets of destiny, and she also wants to regain the throne from the current queen of SkyWings, Queen Ruby. Also, the legendary and powerful mind reader, seer, and animus, Darkstalker, has awoken. He was enchanted to fall asleep under a mountain two thousand years ago by Clearsight. Darkstalker had enchanted himself to be invincible and immortal. He wants to be the king of the NightWings, make them powerful again, and kill the IceWings. The third arc is about dragons in another continent, Pantala. There are three tribes: HiveWings, SilkWings, and LeafWings. Fifty years ago, Queen Wasp, the queen of the HiveWings, said that the Book of Clearsight (an ancient book Clearsight had written to keep the HiveWings safe) said that Queen Wasp should rule all of the tribes. Queen Monarch, the queen of the SilkWings agreed and had the SilkWings be ruled by Queen Wasp. However, Queen Sequoia wanted to see evidence. Wasp didn't show any evidence, and there was a war between the HiveWings and LeafWings called the Tree Wars. Wasp ordered the trees to be cut down, and the LeafWings are nearly extinct."}, "4": {"reviewer": "InvisibleOne", "author": "John Flanagan", "title": "Brotherband Chronicles", "details": "The brother band Chronicles is a great series written by John Flanagan. They are excited, well written and link together with his two more major series, Ranger's Apprentice and Royal Ranger, which are also great reads. "}, "5": {"reviewer": "InvisibleOne", "author": "Myself (InvisibleOne)", "title": "Legends of Coyote", "details": "There are seven (or eight?) books in the Legends of Coyote series.\r\nBOOK ONE: Mystery of the Past:\r\nCoyote (a human not a savagewolfdog) is a trained assassin and bounty hunter. Smart, dangerous, and highly trained, he kidnaps royalty in order to hold them for ransom. After his boss gets on his nerves, he attempts to leave the group that trained them. They didn't like it and he nearly had to kill their leader during his escape. He joins up with another group of assassins and starts a new section of his career. During all the confusion, he learns the secret of just who his father was. \r\nBOOK TWO: Revenge\r\nAfter a good friend of his is attacked and killed by a rival assassin from his old crew, Coyote goes on a mission for revenge. He tracks down the assassin who killed his friend and fights him, managing to disarm him. The rival assassin refuses to surrender, and when he sees that Coyote is not going to kill him, he kills himself in an last-ditch effort to kill Coyote. Coyote then challenges the leader of his old crew to battle once again, and despite his enemies cheating, wins and defeats him. \r\nBOOK THREE: The Fall\r\nHis current group of assassins is attacked by the royal army, hiding out in a cave with his newfound brother and fellow assassins, he is forced to surrender in order to save the life of his brother, who was shot with an arrow. Sentenced to death by gladiators, his only chance of survival is in defeating three highly trained warriors, will he survive?\r\nBOOK FOUR: Survivors\r\nAfter being set free, he finds that his brother has given up his career as an assassin and is looking to marry the love of his life. Stunned and unsure what to think, Coyote travels on a personal journey of understanding, realizing that fighting isn't the only option in his life. \r\nBOOK FIVE: Rising Darkness\r\nNow attempting to protect a town and leave his life of assassination behind. He finds himself picking up his swords once more as one of his old enemies comes back into his life, determined to get revenge. \r\nBOOK SIX: No more Peace\r\nLiving a personal war against a criminal group, he is wounded and knocked into the ocean. He wakes up to find he's on a ship full of slaves with no fighting skills, that is about to be attacked by pirates. Although he's a skilled warrior, his efforts in protecting the ship full of people that has no sails are futile, until a bright young warrior steps in and saves the day. \r\nBOOK SEVEN: Orphan Warrior\r\nNow an old man and not able to fight like he used to, Coyote takes on and trains a young orphan he rescues from the sea after the orphan was thrown overboard by an angry fisherman. His training is not completed before Coyote is attacked by a murderous scoundrel who blames him for his failure in life. Knocked from a cliff and thought dead, his apprentice avenges him and kills his murderer, before ending up on a pirate ship and somehow saving the princesses life. \r\nBOOK EIGHT: Still in progress"}, "6": {"reviewer": "InvisibleOne", "author": "InvisibleOne", "title": "Dragon Warrior", "details": "Sha Khan's father treated him like an animal and tortured him for fun. After his dictator father was thrown from the throne, he thought he would be able to seek a new life of freedom. But his own people as well as the people his father used as slaves for years attempt to kill him, hunting him like an animal. He realizes that because of his father he will never be at peace, and the only way for him to survive is to conquer. His only friend, an ex-assassin, and adrenalin junky travel to Khan's homeland. According to custom, to become emperor one must fight any warrior who wishes to fight them. Khan does just that, killing the current emperor and slaying hordes of challengers. Disgusted by his own actions he lets himself be drawn deeper into the darkness, taking part in a challenge that requires him to fight his friend to the death. Completing the challenge will give him access to an army of dragons, allowing him to conquer any nation that challenges his authority to rule. But his friend isn't just any old slouch, and he won't die too easily..."}, "7": {"reviewer": "JWZ6", "author": "J.K Rowling", "title": "Harry Potter (Sorcerers Stone)", "details": "Too good to describe."}, "8": {"reviewer": "Major_Glitch", "author": "Ruby Bridges", "title": "Through My Eyes", "details": "A nice story I must say. It's a book with people such as the teacher of Ruby Bridges , her, newspaper articles and more. The experience nearly made me cry. "}, "9": {"reviewer": "ruiwenge2", "author": "Alan Gratz", "title": "Refugee", "details": "This book is about three different kids all in different time periods. Josef is from Nazi Germany in the 1930s, and he is Jewish. Isabel is living in Cuba, in 1994. Mahmound is from Syria, in the year 2015. They are all trying to escape their countries."}, "10": {"reviewer": "Test", "author": "Chugong", "title": "Solo Leveling", "details": "“Solo Leveling” is set in South Korea, in a world where portals to dungeons filled with different monsters appeared randomly\r\n\r\n“Solo Leveling” is centered around Sung Jin-Woo, an E-rank hunter, and his journey to becoming an S-rank hunter after receiving a reawakening."}, "14": {"reviewer": "ruiwenge2", "author": "Sharon Creech", "title": "Walk Two Moons", "details": "Sal moves from her farm in Bybanks, Kentucky, to Euclid, Ohio. She and her grandparents are driving all the way to Lewiston, Idaho, to visit her mother. As they're driving, Sal tells the story of her friend Phoebe Winterbottom, her disappearing mother, and the lunatic."}, "15": {"reviewer": "bowzy", "author": "i forgot", "title": "Wizard of oz", "details": "it sucks, dont get it"}, "16": {"reviewer": "ruiwenge2", "author": "Alexandre Dumas", "title": "The Count of Monte Cristo", "details": "This book tells the story of Edmond Dantes, who was wrongly taken to prison, and he dreams of revenge against those who caused it."}}